judge2/app/views/testcases/_index.html.erb

  <tbody>
    <% @problem.testcases.each do |p| %>
---
SELECT "testcases".* FROM "testcases" WHERE "testcases"."problem_id" = 1