judge2/app/controllers/exercises_controller.rb

  def getvalid
      @exercises = Exercise.where("from_date <= :cdate and to_date >= :cdate",{:cdate => DateTime.now.to_s(:db)})
---
SELECT "exercises".* FROM "exercises" WHERE (from_date <= '2012-12-20 12:22:41' and to_date >= '2012-12-20 12:22:41')