judge2/app/controllers/problems_controller.rb

SELECT "problems".* FROM "problems"
---
  def index
    @problems = Problem.all

SELECT "problems".* FROM "problems" WHERE "problems"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @problem = Problem.find(params[:id])

INSERT INTO "problems" ("created_at", "name", "notes", "pdescription_content_type", "pdescription_file_name", "pdescription_file_size", "pdescription_updated_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @problem = Problem.new(params[:problem])

    respond_to do |format|
      if @problem.save